Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20/atdf/ATSAMD20G17U.atdf
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module></modules>
  <pinouts>
    <pinout name="SAMD20GU" caption="SAMD20GU">
      <pin position="A2" pad="PA27"/>
      <pin position="A4" pad="PA28"/>
      <pin position="A6" pad="GNDIO"/>
      <pin position="A8" pad="VDDCORE"/>
      <pin position="A10" pad="VDDIN"/>
      <pin position="A12" pad="PB02"/>
      <pin position="B1" pad="PA25"/>
      <pin position="B3" pad="VDDIO"/>
      <pin position="B5" pad="RESET_N"/>
      <pin position="B7" pad="PA30"/>
      <pin position="B9" pad="PA31"/>
      <pin position="B11" pad="PB03"/>
      <pin position="B13" pad="PA01"/>
      <pin position="C2" pad="PA24"/>
      <pin position="C4" pad="GNDIO"/>
      <pin position="C6" pad="PA22"/>
      <pin position="C8" pad="PA03"/>
      <pin position="C10" pad="PA02"/>
      <pin position="C12" pad="PA00"/>
      <pin position="D1" pad="PA21"/>
      <pin position="D3" pad="PA23"/>
      <pin position="D5" pad="PA16"/>
      <pin position="D7" pad="PA12"/>
      <pin position="D9" pad="PB08"/>
      <pin position="D11" pad="PB04"/>
      <pin position="D13" pad="GNDANA"/>
      <pin position="E2" pad="PA20"/>
      <pin position="E4" pad="PA19"/>
      <pin position="E6" pad="PA09"/>
      <pin position="E8" pad="PA06"/>
      <pin position="E10" pad="PB09"/>
      <pin position="E12" pad="VDDANA"/>
      <pin position="F1" pad="PA18"/>
      <pin position="F3" pad="PA17"/>
      <pin position="F5" pad="PA13"/>
      <pin position="F7" pad="PA11"/>
      <pin position="F9" pad="PA08"/>
      <pin position="F11" pad="PA05"/>
      <pin position="F13" pad="PA04"/>
      <pin position="G2" pad="PA15"/>
      <pin position="G4" pad="PA14"/>
      <pin position="G6" pad="GNDIO"/>
      <pin position="G8" pad="VDDIO"/>
      <pin position="G10" pad="PA10"/>
      <pin position="G12" pad="PA07"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>